================================================================
HAVA ARACI BAKIM PERSONELİ YABANCI DİL SINAVI
SORU BANKASI - BÖLÜM 2: KELİME BİLGİSİ (VOCABULARY)
375 SORU
================================================================

--- SİNONİMLER (SYNONYMS) ---

251. The fuel manifold DELIVERS metered fuel flow to the 30 fuel nozzles.
What is the synonym for "delivers"?
a) collects
b) distributes
c) neglects
d) avoids
ANSWER: b

252. The three-digit numeric function code is used to INDICATE the particular maintenance function.
What is the synonym for "indicate"?
a) demonstrate
b) diminish
c) demolish
d) demand
ANSWER: a

253. If the oil heating system is necessary, REFER to the related Service Bulletin.
What can be used instead of "refer"?
a) ignore
b) consult
c) refuse
d) retreat
ANSWER: b

254. 'Day of discovery' means the calendar day that a malfunction was RECORDED in the maintenance log.
What is another word for "recorded"?
a) rejected
b) restricted
c) registered
d) refused
ANSWER: c

255. Any situation that could POSSIBLY crush or penetrate the case of the beacon should be avoided.
What is the synonym for "possibly"?
a) potentially
b) remotely
c) definitely
d) doubtfully
ANSWER: a

256. The tail bearing housing CONTAINS three speed probes configured to read LP turbine speed.
Which one CANNOT be used for "contains"?
a) involves
b) includes
c) invades
d) features
ANSWER: c

257. All calendar days are considered to run CONSECUTIVELY.
What is the meaning of "consecutively"?
a) simultaneously
b) in a random order
c) one after another
d) spontaneously
ANSWER: c

258. Park the aircraft on a FLAT surface.
What is a synonym for "flat"?
a) smooth
b) curved
c) rough
d) bumpy
ANSWER: a

259. If there is a short circuit, you will cause damage to the serviceable computer when you SWAP the units.
Which verb can be used instead of "swap"?
a) displace
b) purchase
c) repair
d) use
ANSWER: a

260. The drag is normally approx. 40 lbf.in. The PERMITTED maximum is 107 lbf.in.
What does "permitted" mean?
a) forbidden
b) mandatory
c) allowed
d) optional
ANSWER: c

261. 'Safe operation of aircraft in cold weather conditions RAISES specific problems.'
Which phrasal verb could be used for "to raise"?
a) put off
b) back up
c) sort out
d) bring about
ANSWER: d

262. Additional maintenance task may be required DEPENDING on the failure modes.
What does "depending" mean in this context?
a) attributing
b) contingent
c) boarding
d) caressing
ANSWER: b

263. The outside of extinguishers should be cleaned with cotton wipers, REMOVING grease and dust.
a) installing
b) transporting
c) saving
d) removing
ANSWER: d

264. You must OBEY the wiring standard practices to ensure proper electrical fault isolation.
What is the synonym for "obey"?
a) obtain
b) obscure
c) follow
d) oppose
ANSWER: c

265. The emergency shutdown procedure must only be used when UNUSUAL conditions occur.
What is the synonym for "unusual"?
a) ordinary
b) abnormal
c) normal
d) common
ANSWER: b

266. Do a general visual INSPECTION of the forward avionic compartment.
What is the synonym for "inspection"?
a) installation
b) replacement
c) examination
d) operation
ANSWER: c

267. The maintenance data must be ACCURATE to ensure correct repair.
What is the synonym for "accurate"?
a) approximate
b) precise
c) vague
d) rough
ANSWER: b

268. You must ENSURE that all safety pins are installed before towing the aircraft.
What is the synonym for "ensure"?
a) hope
b) assume
c) make sure
d) expect
ANSWER: c

269. The hydraulic fluid must be COMPATIBLE with the system seals and components.
What is the synonym for "compatible"?
a) incompatible
b) suitable
c) conflicting
d) contrasting
ANSWER: b

270. The aircraft must be AIRWORTHY before it is released for flight.
What is the synonym for "airworthy"?
a) unsafe
b) grounded
c) fit to fly
d) overdue
ANSWER: c

271. The technician must VERIFY the part number before installation.
What is the synonym for "verify"?
a) ignore
b) assume
c) confirm
d) dispute
ANSWER: c

272. The procedure was REVISED to include the latest safety requirements.
What is the synonym for "revised"?
a) removed
b) updated
c) rejected
d) ignored
ANSWER: b

273. The maintenance schedule SPECIFIES the inspection intervals for each component.
What is the synonym for "specifies"?
a) hides
b) ignores
c) defines
d) removes
ANSWER: c

274. It is MANDATORY to carry a first aid kit on all commercial flights.
What is the synonym for "mandatory"?
a) optional
b) recommended
c) compulsory
d) suggested
ANSWER: c

275. The technician must DISCONNECT the battery before working on the electrical system.
What is the synonym for "disconnect"?
a) attach
b) unplug
c) install
d) secure
ANSWER: b

276. The ADJACENT structure must be inspected for damage after a hard landing.
What is the synonym for "adjacent"?
a) far
b) surrounding
c) hidden
d) distant
ANSWER: b

277. The corrosion was found to be SUPERFICIAL and did not affect structural integrity.
What is the synonym for "superficial"?
a) deep
b) severe
c) surface-level
d) critical
ANSWER: c

278. The borescope probe provides ILLUMINATION inside the engine cavity.
What is the synonym for "illumination"?
a) darkness
b) lighting
c) shadow
d) covering
ANSWER: b

279. The maintenance engineer ANNOTATED the drawing to show the modification areas.
What is the synonym for "annotated"?
a) removed
b) destroyed
c) marked with notes
d) laminated
ANSWER: c

280. The aircraft is PROHIBITED from flying with the emergency exit blocked.
What is the synonym for "prohibited"?
a) allowed
b) required
c) forbidden
d) recommended
ANSWER: c

281. The DEFECTIVE brake pad was replaced during the unscheduled maintenance check.
What is the synonym for "defective"?
a) new
b) faulty
c) serviceable
d) calibrated
ANSWER: b

282. You must RETAIN the old part for inspection by the quality department.
What is the synonym for "retain"?
a) discard
b) dispose
c) keep
d) ship
ANSWER: c

283. The engineer must MONITOR the hydraulic pressure throughout the ground test.
What is the synonym for "monitor"?
a) ignore
b) observe
c) increase
d) reduce
ANSWER: b

284. The structural damage was ASSESSED by the designated engineering authority.
What is the synonym for "assessed"?
a) caused
b) ignored
c) evaluated
d) removed
ANSWER: c

285. The component was found to be SERVICEABLE after the detailed inspection.
What is the synonym for "serviceable"?
a) unfit
b) broken
c) worn
d) functional
ANSWER: d

286. The repair was AUTHORIZED by the quality assurance department.
What is the synonym for "authorized"?
a) rejected
b) approved
c) delayed
d) cancelled
ANSWER: b

287. The PROXIMITY of the fuel line to the ignition source posed a fire risk.
What is the synonym for "proximity"?
a) distance
b) similarity
c) nearness
d) function
ANSWER: c

288. The test CONFIRMED that the hydraulic pump was operating within limits.
What is the synonym for "confirmed"?
a) denied
b) disputed
c) verified
d) questioned
ANSWER: c

289. The technician must ADHERE to the maintenance procedures without deviation.
What is the synonym for "adhere to"?
a) ignore
b) modify
c) follow strictly
d) challenge
ANSWER: c

290. The temperature EXCEEDED the red line limit, triggering the overheat warning.
What is the synonym for "exceeded"?
a) fell below
b) went beyond
c) reached
d) approached
ANSWER: b

291. The access panel was SECURED with the correct fasteners and lock wire.
What is the synonym for "secured"?
a) loosened
b) fastened
c) removed
d) replaced
ANSWER: b

292. The engineer DOCUMENTED all findings in the aircraft technical log.
What is the synonym for "documented"?
a) deleted
b) ignored
c) recorded
d) erased
ANSWER: c

293. The anti-corrosion treatment INHIBITS the formation of rust on the metal surface.
What is the synonym for "inhibits"?
a) promotes
b) prevents
c) causes
d) accelerates
ANSWER: b

294. The fuel RESIDUE in the tank must be removed before any hot work.
What is the synonym for "residue"?
a) surplus
b) supply
c) remainder
d) shortage
ANSWER: c

295. The technician was COMPETENT to perform the complex avionics task.
What is the synonym for "competent"?
a) unqualified
b) capable
c) inexperienced
d) unauthorized
ANSWER: b

296. The pressure DIFFERENTIAL across the fuel filter was within limits.
What is the synonym for "differential"?
a) total
b) sum
c) difference
d) average
ANSWER: c

297. The airframe structure must WITHSTAND the design ultimate load.
What is the synonym for "withstand"?
a) collapse under
b) resist
c) avoid
d) transfer
ANSWER: b

298. The PRELIMINARY inspection showed no visible damage to the exterior.
What is the synonym for "preliminary"?
a) final
b) detailed
c) initial
d) thorough
ANSWER: c

299. The maintenance interval was EXTENDED based on the service experience data.
What is the synonym for "extended"?
a) shortened
b) cancelled
c) prolonged
d) maintained
ANSWER: c

300. The crack PROPAGATED along the grain boundary due to fatigue.
What is the synonym for "propagated"?
a) stopped
b) spread
c) disappeared
d) healed
ANSWER: b

--- ZIT ANLAMLILAR (ANTONYMS) ---

301. If you find seal or shroud interference and you think it is "MINOR", the engine is serviceable.
What is the OPPOSITE of "minor"?
a) small
b) major
c) miniscule
d) mini
ANSWER: b

302. If you do not repair the protection within 2 hours, apply a corrosion preventive oil as a "TEMPORARY" protection.
The OPPOSITE of "temporary" is:
a) brief
b) intermittent
c) permanent
d) short
ANSWER: c

303. The wheel assembly has an "OUTER" wheel half assembly.
What is the OPPOSITE of "outer"?
a) exterior
b) outside
c) inner
d) surface
ANSWER: c

304. Both air conditioning packs are "OPERATIVE".
"Operative" can be replaced with:
a) futile
b) abortive
c) incapable
d) functional
ANSWER: d

305. The "MANUAL" transfer may be performed.
The OPPOSITE of "manual" is:
a) by hand
b) automatic
c) manpower
d) handled
ANSWER: b

306. Inspect window for "ALLOWABLE" damage limits.
"Allowable" means:
a) banned
b) rejected
c) acceptable
d) denied
ANSWER: c

307. Do a "DETAILED" visual inspection of the two external power receptacles.
The OPPOSITE of "detailed" is:
a) thorough
b) complete
c) superficial
d) specific
ANSWER: c

308. "POTENTIAL" consequences are that wires may become open circuit.
"Potential" can be replaced with:
a) actual
b) real
c) factual
d) possible
ANSWER: d

309. The aircraft was RELEASED from maintenance after the work was completed.
The OPPOSITE of "released" is:
a) freed
b) dispatched
c) retained
d) approved
ANSWER: c

310. The repair procedure is COMPLEX and requires specialized tooling.
The OPPOSITE of "complex" is:
a) sophisticated
b) simple
c) detailed
d) thorough
ANSWER: b

311. The engine ran CONTINUOUSLY for 6 hours during the endurance test.
The OPPOSITE of "continuously" is:
a) frequently
b) regularly
c) intermittently
d) constantly
ANSWER: c

312. The component showed SIGNIFICANT wear after 5000 flight cycles.
The OPPOSITE of "significant" is:
a) considerable
b) notable
c) marginal
d) important
ANSWER: c

313. The access panel was ACCESSIBLE without removing the engine.
The OPPOSITE of "accessible" is:
a) easy to reach
b) convenient
c) inaccessible
d) available
ANSWER: c

314. The MAXIMUM allowable weight for the forward hold is 3500 kg.
The OPPOSITE of "maximum" is:
a) greater
b) minimum
c) upper
d) elevated
ANSWER: b

315. The oil was found to be CONTAMINATED with metal particles.
The OPPOSITE of "contaminated" is:
a) polluted
b) dirty
c) clean
d) mixed
ANSWER: c

316. The procedure was APPROVED by the design authority.
The OPPOSITE of "approved" is:
a) accepted
b) sanctioned
c) rejected
d) confirmed
ANSWER: c

317. The aircraft was PRESSURIZED to cabin altitude of 8000 feet.
The OPPOSITE of "pressurized" is:
a) inflated
b) sealed
c) depressurized
d) compressed
ANSWER: c

318. The MANDATORY inspection must be completed before the aircraft returns to service.
The OPPOSITE of "mandatory" is:
a) compulsory
b) required
c) optional
d) essential
ANSWER: c

319. The corrosion treatment PREVENTS further oxidation of the metal surface.
The OPPOSITE of "prevents" is:
a) stops
b) blocks
c) promotes
d) inhibits
ANSWER: c

320. The fuel system was INTACT after the bird strike event.
The OPPOSITE of "intact" is:
a) undamaged
b) whole
c) complete
d) damaged
ANSWER: d

321. The maintenance record was COMPLETE before the aircraft was dispatched.
The OPPOSITE of "complete" is:
a) finished
b) thorough
c) incomplete
d) detailed
ANSWER: c

322. The engine was SERVICEABLE after the compressor blade replacement.
The OPPOSITE of "serviceable" is:
a) functional
b) operative
c) unserviceable
d) capable
ANSWER: c

323. The aircraft was PARKED in the hangar for the duration of the C-check.
The OPPOSITE of "parked" is:
a) stopped
b) in service
c) stationary
d) grounded
ANSWER: b

324. The hydraulic system operated NORMALLY after the seal replacement.
The OPPOSITE of "normally" is:
a) correctly
b) abnormally
c) properly
d) efficiently
ANSWER: b

325. All INTERNAL aircraft components were checked during the scheduled inspection.
The OPPOSITE of "internal" is:
a) inside
b) interior
c) external
d) hidden
ANSWER: c

--- ANLAM / TANIM (DEFINITIONS) ---

326. This can cause "THERMAL" shock to the stressed parts.
What does "thermal" mean?
a) relating to sound
b) relating to mass
c) relating to liquid
d) relating to heat
ANSWER: d

327. All the inspections are visual "UNLESS" otherwise specified.
"Unless" can be replaced with:
a) if not
b) if
c) useless
d) although
ANSWER: a

328. Do a general visual inspection of the "FORWARD" avionic compartment.
What is the synonym of "forward"?
a) aft
b) starboard
c) port
d) front
ANSWER: d

329. Do a general "VISUAL" inspection of the FWD and AFT passenger doors.
"Visual" means:
a) relating to sight or seeing
b) relating to sound
c) relating to audio
d) relating to texture
ANSWER: a

330. If the pressure will "EXCEED" 20 PSI absolute, you must remove the oxygen equipment.
What can be used instead of "exceed"?
a) surpass
b) exclude
c) lower
d) decrease
ANSWER: a

331. To remove deep signs of corrosion, brush the part with an "ABRASIVE" material.
"Abrasive" means:
a) polishing the surface gently
b) applying a protective coat
c) causing damage or wear by friction
d) painting a material
ANSWER: c

332. Major sub-zones are IDENTIFIED by the tens of the major zones.
What does "identify" mean?
a) to question something's identity
b) to confuse something's identity
c) to recognize something's identity
d) to change something's identity
ANSWER: c

333. The aircraft must be CERTIFIED before it enters revenue service.
What does "certified" mean?
a) grounded
b) officially approved as airworthy
c) rejected by authorities
d) under maintenance
ANSWER: b

334. The structural repair manual provides GUIDANCE on acceptable repair methods.
What does "guidance" mean?
a) restriction
b) prohibition
c) direction and advice
d) limitation
ANSWER: c

335. The maintenance technician must CALIBRATE the torque wrench before use.
What does "calibrate" mean?
a) discard
b) adjust to a standard
c) replace
d) inspect visually
ANSWER: b

336. The airworthiness directive is MANDATORY for all operators of the aircraft type.
What does "mandatory" mean?
a) optional
b) recommended
c) compulsory
d) suggested
ANSWER: c

337. The LUBRICANT reduces friction between moving engine components.
What does "lubricant" mean?
a) a fuel additive
b) a fluid that reduces friction
c) a cleaning agent
d) a sealing compound
ANSWER: b

338. The aircraft underwent a STRUCTURAL survey after the tail strike incident.
What does "structural" mean?
a) relating to systems
b) relating to avionics
c) relating to the framework of the aircraft
d) relating to the engines
ANSWER: c

339. The oxygen system is PRESSURIZED to provide flow to the masks.
What does "pressurized" mean?
a) sealed tightly
b) inflated with high pressure gas
c) emptied of all gas
d) maintained at atmospheric pressure
ANSWER: b

340. The BORESCOPE inspection revealed a cracked turbine blade.
What is a borescope?
a) a handheld cutting tool
b) a flexible optical device for internal inspection
c) a pressure measurement device
d) a noise measurement instrument
ANSWER: b

341. The landing gear RETRACTION was tested on jacks before the aircraft's first flight.
What does "retraction" mean?
a) extension downward
b) movement forward
c) drawing back or folding up
d) locking in place
ANSWER: c

342. The AILERON provides roll control for the aircraft.
What is an aileron?
a) a moveable surface on the horizontal stabilizer
b) a moveable surface on the wing for roll control
c) a vertical surface on the fin
d) a high-lift device on the leading edge
ANSWER: b

343. The HYDRAULIC accumulator stores energy in the form of pressurized fluid.
What is an accumulator?
a) a device that generates hydraulic pressure
b) a device that stores pressurized fluid or gas
c) a device that measures fluid flow
d) a device that filters hydraulic fluid
ANSWER: b

344. The TRANSPONDER sends identification and altitude information to air traffic control.
What is a transponder?
a) a communication radio
b) a navigation system
c) a radio device that responds to radar interrogation
d) a weather radar unit
ANSWER: c

345. The SQUIB on the fire extinguisher initiates the discharge when activated.
What is a squib?
a) a pressure gauge
b) an explosive device used to activate the fire bottle
c) a flow control valve
d) a temperature sensor
ANSWER: b

346. The TARE weight is the weight of the aircraft without fuel or payload.
What does "tare weight" mean?
a) maximum takeoff weight
b) landing weight
c) the empty weight of the aircraft
d) the fuel weight
ANSWER: c

347. The FATIGUE life of the component is expressed in flight cycles.
What does "fatigue" mean in aviation context?
a) a state of extreme tiredness
b) weakening of metal due to repeated stress cycles
c) overheating of components
d) corrosion from moisture
ANSWER: b

348. The DATUM line is used as a reference point for weight and balance calculations.
What is a datum?
a) a measurement tool
b) a type of fuel
c) a fixed reference point
d) a structural component
ANSWER: c

349. The aircraft's AIRWORTHINESS certificate was issued after the initial certification.
What does "airworthiness" mean?
a) the ability of the aircraft to perform well
b) the condition of being fit and safe to fly
c) the weight of the aircraft
d) the speed of the aircraft
ANSWER: b

350. The fuel CONTAMINATION was caused by water ingress during the refueling operation.
What does "contamination" mean?
a) the process of adding fuel
b) the presence of unwanted substances in a material
c) the measurement of fuel quantity
d) the heating of fuel
ANSWER: b

--- KELİME FORMLARI (WORD FORMS) ---

351. The dust can cause ………… on all filter elements.
a) contaminated
b) contamination
c) contaminant
d) contaminate
ANSWER: b

352. The brake temperature ………… monitors the brake temperature during landing.
a) sensor
b) sensory
c) sense
d) sensers
ANSWER: a

353. The pilot must report the ………… encounter of this event.
a) suspected
b) suspect
c) suspecting
d) susceptible
ANSWER: a

354. After 1 hour, use fog or foam on the wheel or tire to decrease the ………….
a) temperature
b) temperate
c) temperament
d) tempt
ANSWER: a

355. Lift the ………… blankets sufficiently to complete a correct general visual inspection.
a) insulate
b) insolution
c) insoluble
d) insulation
ANSWER: d

356. The number of passengers must be ………… to 165 passengers.
a) limiting
b) limited
c) limitation
d) limitless
ANSWER: b

357. Count and ………… the utilized tools after the maintenance task.
a) verification
b) verified
c) verify
d) vivificated
ANSWER: c

358. Reinstall the shelves and panels affected ………… this modification.
a) but
b) by
c) as
d) both
ANSWER: b

359. The ………… of the oxygen system pressure must be checked before each flight.
a) adequate
b) adequacy
c) adequately
d) adequated
ANSWER: b

360. The maintenance team showed great ………… in completing the C-check on schedule.
a) efficient
b) efficiency
c) efficiently
d) efficiencies
ANSWER: b

361. The engine runs ………… after the replacement of the worn compressor blades.
a) smooth
b) smoothly
c) smoothness
d) smoother
ANSWER: b

362. The ………… of the hydraulic fluid must meet the specifications in the maintenance manual.
a) viscous
b) viscosity
c) viscously
d) viscose
ANSWER: b

363. The seat must be tested for ………… before the aircraft returns to service.
a) function
b) functional
c) functionally
d) functionality
ANSWER: d

364. The corrosion on the wing skin was treated with an approved ………… compound.
a) inhibit
b) inhibition
c) inhibitory
d) inhibitor
ANSWER: d

365. The engineer provided ………… during the complex structural repair.
a) supervise
b) supervisory
c) supervision
d) supervisor
ANSWER: c

366. The maintenance was carried out with great ………… to ensure no errors were made.
a) care
b) careful
c) carefully
d) carefulness
ANSWER: a

367. The fluid ………… was higher than expected, indicating a leak in the system.
a) consume
b) consumer
c) consumption
d) consumed
ANSWER: c

368. The component failed the ………… inspection and was removed from service.
a) functioned
b) functional
c) function
d) functioning
ANSWER: b

369. The hydraulic seal showed signs of ………… after 3000 flight hours.
a) degrade
b) degradation
c) degraded
d) degrading
ANSWER: b

370. The ………… of the engine mount bolts must be checked at every A-check.
a) tight
b) tighten
c) tightness
d) tightly
ANSWER: c

--- FİİL + EDATlı BİRLEŞİKLER / FRASAL FİİLLER (PHRASAL VERBS & COLLOCATIONS) ---

371. The technician must ………… the old sealant before applying the new compound.
a) put up
b) take off
c) strip off
d) come down
ANSWER: c

372. The system will ………… automatically if the temperature exceeds the limit.
a) shut down
b) shut up
c) shut off
d) shut in
ANSWER: a

373. Please ………… the engine before performing maintenance on the fuel system.
a) turn on
b) turn up
c) turn down
d) shut down
ANSWER: d

374. The technician will ………… the results of the test in the maintenance log.
a) write up
b) write off
c) write down
d) write in
ANSWER: c

375. The warning light ………… when the brake temperature reached the red line.
a) came on
b) came out
c) came off
d) came up
ANSWER: a

376. The maintenance team must ………… the work order before the aircraft is released.
a) fill in
b) fill out
c) fill up
d) fill over
ANSWER: b

377. The technician had to ………… the faulty component several times before finding the fault.
a) look for
b) look after
c) look into
d) look up
ANSWER: c

378. The procedure was ………… to include the latest safety requirements.
a) written off
b) brought up
c) drawn up
d) worked out
ANSWER: c

379. Before the aircraft can depart, all deferred defects must be ………….
a) signed off
b) signed in
c) signed up
d) signed over
ANSWER: a

380. The engineer will ………… the test results with the quality department.
a) go over
b) go through
c) go ahead
d) go with
ANSWER: b

381. The maintenance check was ………… due to a shortage of spare parts.
a) held up
b) held on
c) held back
d) held out
ANSWER: a

382. The hydraulic leak was ………… during the routine daily check.
a) picked out
b) picked up
c) picked on
d) picked off
ANSWER: b

383. The aircraft had to ………… after takeoff due to an engine fault indication.
a) turn back
b) turn over
c) turn around
d) turn down
ANSWER: a

384. The maintenance team needs to ………… the cause of the repeated hydraulic failures.
a) find out
b) find off
c) find in
d) find on
ANSWER: a

385. The engine ………… on the second attempt after the starter motor was replaced.
a) started up
b) started off
c) started out
d) started in
ANSWER: a

386. The engineer ………… the faulty component with a serviceable one.
a) swapped out
b) swapped in
c) swapped on
d) swapped up
ANSWER: a

387. The technician must ………… all tools from the aircraft before closing the panels.
a) take away
b) take out
c) remove
d) both b and c
ANSWER: d

388. The pressure check showed that the system ………… gradually during the test.
a) leaked out
b) leaked off
c) leaked down
d) leaked in
ANSWER: a

389. The aircraft will be ………… for maintenance starting Monday.
a) taken out of service
b) taken into service
c) taken away
d) taken up
ANSWER: a

390. All safety data sheets must be ………… in the maintenance workshop.
a) put up
b) put in
c) put on
d) put by
ANSWER: a

--- BAĞLAM İÇİNDE KELİME (VOCABULARY IN CONTEXT) ---

391. This lighting system is ………… used at night for the check lists.
a) special
b) specially
c) spaciously
d) spacious
ANSWER: b

392. You must be ………… when you do work on the engine parts after shutdown.
a) careful
b) carefree
c) caring
d) careless
ANSWER: a

393. Wear ………… eye and face protection when servicing batteries.
a) casual
b) incorrect
c) faulty
d) proper
ANSWER: d

394. During parking for not more than 15 days, you must do a ………… ground check at 7-day intervals.
a) periodic
b) monthly
c) annual
d) weekly
ANSWER: a

395. You must get a sample of the oil which has contamination for ………… analysis.
a) local
b) location
c) locally
d) laboratory
ANSWER: d

396. If the serial number is ………… do the replacement at the first opportunity.
a) confirmed
b) suspected
c) verified
d) approved
ANSWER: b

397. Make sure the main entry door moves ………… to the close position.
a) hardly
b) strenuously
c) smoothly
d) roughly
ANSWER: c

398. Additional maintenance task may be required ………… on the failure modes.
a) depending
b) attributing
c) boarding
d) caressing
ANSWER: a

399. All aural alerts which are normally routed through the speakers must be ………… through the headsets.
a) audible
b) auditory
c) loud
d) auditable
ANSWER: a

400. The oxygen mask must be within ………… reach of all passengers.
a) easy
b) simple
c) immediate
d) direct
ANSWER: a

401. The engine must be ………… checked after a bird strike event.
a) thoroughly
b) partially
c) briefly
d) occasionally
ANSWER: a

402. The aircraft is ………… in service with multiple operators worldwide.
a) currently
b) previously
c) formerly
d) soon
ANSWER: a

403. A ………… inspection is required after the aircraft has been struck by lightning.
a) routine
b) thorough
c) visual
d) brief
ANSWER: b

404. The damage found during the inspection was ………… and did not affect airworthiness.
a) critical
b) severe
c) negligible
d) major
ANSWER: c

405. The maintenance task is ………… to complete and requires only basic tooling.
a) difficult
b) complex
c) straightforward
d) specialized
ANSWER: c

406. The AMM provides ………… instructions for each maintenance task.
a) vague
b) approximate
c) detailed
d) general
ANSWER: c

407. The technician must ………… all findings in the aircraft technical log.
a) ignore
b) estimate
c) document
d) discard
ANSWER: c

408. The hydraulic system must be ………… before any work is performed on it.
a) pressurized
b) depressurized
c) heated
d) cooled
ANSWER: b

409. The engine components are ………… numbered for easy identification.
a) arbitrarily
b) sequentially
c) randomly
d) roughly
ANSWER: b

410. The maintenance team must ………… with all safety regulations during the repair.
a) disagree
b) argue
c) comply
d) dispute
ANSWER: c

411. The service bulletin is ………… for all operators of the aircraft type.
a) mandatory
b) optional
c) suggested
d) recommended
ANSWER: a

412. The landing gear EXTENSION was verified during the pre-flight inspection.
What does "extension" mean in this context?
a) prolonging the landing gear
b) lowering the landing gear to the down position
c) retracting the landing gear
d) replacing the landing gear
ANSWER: b

413. The hydraulic fluid must be ………… to prevent contamination of the new system.
a) added
b) replaced
c) flushed out
d) heated
ANSWER: c

414. The ………… of the engine is measured in terms of thrust output.
a) performance
b) appearance
c) weight
d) color
ANSWER: a

415. The technician should wear ………… when handling Skydrol hydraulic fluid.
a) chemical-resistant gloves
b) thin cotton gloves
c) no protection needed
d) steel-toed boots only
ANSWER: a

416. The pressure relief valve ………… excess pressure from the hydraulic system.
a) adds
b) generates
c) releases
d) measures
ANSWER: c

417. The AVIONICS compartment contains navigation and communication equipment.
What does "avionics" refer to?
a) aircraft fuel systems
b) aircraft electrical and electronic systems
c) aircraft hydraulic systems
d) aircraft structural components
ANSWER: b

418. The ………… must be signed off by a licensed engineer before the aircraft can fly.
a) work order
b) departure list
c) passenger manifest
d) cargo document
ANSWER: a

419. The TORQUE value for the bolt must not exceed 150 Nm.
What does "torque" mean?
a) the length of a bolt
b) the rotational force applied when tightening
c) the material of a bolt
d) the size of a thread
ANSWER: b

420. The rubber seal showed signs of ………… after prolonged exposure to hydraulic fluid.
a) expansion
b) deterioration
c) hardening
d) improvement
ANSWER: b

421. The navigation system was ………… with the new software update.
a) downgraded
b) upgraded
c) replaced
d) removed
ANSWER: b

422. The aircraft was given a ………… of airworthiness by the regulatory authority.
a) denial
b) rejection
c) certificate
d) refusal
ANSWER: c

423. The maintenance team should check the ………… of all structural fasteners.
a) color
b) brand
c) integrity
d) origin
ANSWER: c

424. The ground crew must ensure the aircraft is properly ………… before departure.
a) grounded
b) positioned
c) cleaned
d) warmed
ANSWER: b

425. The hydraulic pump provides ………… to operate the flight control actuators.
a) temperature
b) pressure
c) weight
d) resistance
ANSWER: b

================================================================
CEVAP ANAHTARI - BÖLÜM 2: KELİME BİLGİSİ
================================================================
251-b 252-a 253-b 254-c 255-a 256-c 257-c 258-a 259-a 260-c
261-d 262-b 263-d 264-c 265-b 266-c 267-b 268-c 269-b 270-c
271-c 272-b 273-c 274-c 275-b 276-b 277-c 278-b 279-c 280-c
281-b 282-c 283-b 284-c 285-d 286-b 287-c 288-c 289-c 290-b
291-b 292-c 293-b 294-c 295-b 296-c 297-b 298-c 299-c 300-b
301-b 302-c 303-c 304-d 305-b 306-c 307-c 308-d 309-c 310-b
311-c 312-c 313-c 314-b 315-c 316-c 317-c 318-c 319-c 320-d
321-c 322-c 323-b 324-b 325-c 326-d 327-a 328-d 329-a 330-a
331-c 332-c 333-b 334-c 335-b 336-c 337-b 338-c 339-b 340-b
341-c 342-b 343-b 344-c 345-b 346-c 347-b 348-c 349-b 350-b
351-b 352-a 353-a 354-a 355-d 356-b 357-c 358-b 359-b 360-b
361-b 362-b 363-d 364-d 365-c 366-a 367-c 368-b 369-b 370-c
371-c 372-a 373-d 374-c 375-a 376-b 377-c 378-c 379-a 380-b
381-a 382-b 383-a 384-a 385-a 386-a 387-d 388-a 389-a 390-a
391-b 392-a 393-d 394-a 395-d 396-b 397-c 398-a 399-a 400-a
401-a 402-a 403-b 404-c 405-c 406-c 407-c 408-b 409-b 410-c
411-a 412-b 413-c 414-a 415-a 416-c 417-b 418-a 419-b 420-b
421-b 422-c 423-c 424-b 425-b
